[
    {
        "id": 1,
        "name": "Articuno",
        "imageName": "articuno",
        "type": "Ice, Flight",
        "description": "Articuno is a legendary bird Pokémon that can control ice. The flapping of its wings chills the air. As a result, it is said that when this Pokémon flies, snow will fall."
    },
    {
        "id": 2,
        "name": "Charizard",
        "imageName": "charizard",
        "type": "Fire, flight",
        "description": "Charizard flies around the sky in search of powerful opponents. It breathes fire of such great heat that it melts anything. However, it never turns its fiery breath on any opponent weaker than itself."
    },
    {
        "id": 3,
        "name": "Charmander",
        "imageName": "charmander",
        "type": "Fire",
        "description": "Charmander is a Fire-type Pokémon. It evolves into Charmeleon starting at level 16, which evolves into Charizard starting at level 36."
    },
    {
        "id": 4,
        "name": "Charmeleon",  
        "imageName": "charmeleon",
        "type": "Fire",
        "description": "Charmeleon is a Fire-type Pokémon. It evolves from Charmander starting at level 16 and evolves into Charizard starting at level 36."   
    },
    {
        "id": 5,
        "name": "Mewtwo",
        "imageName": "mewtwo",
        "type": "Psychic",
        "description": "Mewtwo is a Pokémon that was created by genetic manipulation. However, even though the scientific power of humans created this Pokémon's body, they failed to endow Mewtwo with a compassionate heart."
    },
    {
        "id": 6,
        "name": "Squirtle",
        "imageName": "squirtle",
        "type": "Water",
        "description": "Squirtle is a Water-type Pokémon. It evolves into Wartortle starting at level 16, which evolves into Blastoise starting at level 36."
    },
    {
        "id": 7,
        "name": "Vaporeon",
        "imageName": "vaporeon",
        "type": "Water",
        "description": "Vaporeon is a Water-type Pokémon. It evolves from Eevee when exposed to a Water Stone. It is one of Eevee's final forms, the others being Jolteon, Flareon, Espeon, Umbreon, Leafeon, Glaceon, and Sylveon."
    },
    {
        "id": 8,
        "name": "Venusaur",
        "imageName": "venusaur",
        "type": "Plant, Poison",
        "description": "Venusaurs have the ability to manipulate the growth of plant life. When it is raining, the flower on its back smells stronger."
    },
    {
        "id": 9,
        "name": "Bulbasaur",
        "imageName": "bulbasaur",
        "type": "Plant, Poison",
        "description": "Bulbasaur is a dual-type Grass/Poison Pokémon introduced in Generation I. It evolves into Ivysaur starting at level 16, which evolves into Venusaur starting at level 32."
    },
    {
        "id": 10,
        "name": "Pikachu",
        "imageName": "picachu",
        "type": "Electric",
        "description": "Pikachu is an Electric-type Pokémon. It evolves from Pichu when leveled up with high friendship and evolves into Raichu when exposed to a Thunder Stone."
    }
]